src_doc/Catalogs/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантПодписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПодписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоАдресатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоКонтрагентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоНоменклатуреДел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоСтатьямДДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоТематикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетСторон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетТоваровИУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключенУчетПоНоменклатуреДел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьСозданиеДокументовНеПоШаблону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВажность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВременныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСрокИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭДО</Name>
					<Comment>Использовать обмен электронными документами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьНаличиеОригинала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьУникальностьДокументаВРамкахПроекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаПечатьШтрихкода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязателенФайлОригинала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеУказаниеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноУказаниеПроекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРучноеИзменениеСписковДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполненияУказанВРабочихДнях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВходящийНомерИДатуПолучателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьМестоХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияПолейХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНедействующиеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьОтветственногоЗаХранение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияПолейХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСрокДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСуммуДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяВходящейКорреспонденцией</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДоговором</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяЗаявкойНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяИсходящейКорреспонденцией</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяКомплектомДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяОбращениемОтГраждан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаименованияСторон</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеСтороны</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаименованияСторон</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимыОрганизации</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимыКонтрагенты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимыСотрудники</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоОдинФайл</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФайлЭлектронногоДокумента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/Catalogs/ТематикиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТематикиДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействуетДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/Catalogs/НастройкиОбработкиВидовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиОбработкиВидовОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБизнесСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБизнесСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнтерактивногоСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнтерактивныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидОбъектаСОбработкой</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДействий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияЗапуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстПредупреждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АлгоритмыПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияПроверкиВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПредупреждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АлгоритмыПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФункцииУчастниковДействий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеЭтапа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/CommonForms/ВидыДокументов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Тематики.Видимость = РаботаСТематикамиДокументов.ТематикиИспользуются();
	Элементы.СписокВидыДокументовИндекс.Видимость = Нумерация.ИспользуетсяПолеНумерации("ИндексВидаДокумента");
	
	Если Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора Тогда 
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Элементы.ГруппаРежимВыбора.Видимость = Истина;
		
		Элементы.СписокВидыДокументов.РежимВыбора = Истина;
		
		Если Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда 
			Если ТипЗнч(Параметры.ТекущаяСтрока) = Тип("СправочникСсылка.ВидыДокументов") Тогда 	
				Элементы.Списки.ТекущаяСтраница = Элементы.ГруппаСписокВидыДокументов;
				Элементы.СписокВидыДокументов.ТекущаяСтрока = Параметры.ТекущаяСтрока;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиФормы = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(ИмяФормы + "/ТекущиеДанные", "");
	Если НастройкиФормы = Неопределено Или НастройкиФормы.Получить("ПоказыватьУдаленные") = Неопределено Тогда
		ПоказатьУдаленные();
	КонецЕсли;
	
	Делопроизводство.СписокДокументовУсловноеОформлениеПомеченныхНаУдаление(СписокВидыДокументов);
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Тематики");
	МассивКолонок.Добавить("Шаблоны");
	МассивКолонок.Добавить("КартинкаСветофор");
	МассивКолонок.Добавить("ОбработкаЗадана");
	СписокВидыДокументов.УстановитьОграниченияИспользованияВПорядке(
		МассивКолонок);
		
	НастроитьФормуДляМобильногоПриНеобходимости();
	
	МультиязычностьСервер.ИзменениеТекстаЗапросаСпискаДляТекущегоЯзыка(
		ЭтотОбъект, "СписокВидыДокументов");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки["ПоказыватьУдаленные"] <> Неопределено Тогда
		ПоказатьУдаленные();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТематикиПомеченыНаУдаление" Или ИмяСобытия = "ШаблонПомеченНаУдаление" 
		Или ИмяСобытия = "ТематикаДокумента_Создание" Или ИмяСобытия = "ИзмененШаблонДокумента" Тогда
		Элементы.СписокВидыДокументов.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписки

&НаКлиенте
Процедура СписокВидыДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = РаботаСоСпискамиДокументовКлиент.ПолучитьДанныеТекущейСтрокиСписка(
		Элементы.СписокВидыДокументов, Элементы.СписокВидыДокументов.ТекущаяСтрока);
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.Ссылка);
	
	Если Поле = Элементы.Тематики Тогда
		ПараметрыОткрытия.Вставить("ОткрытьЗакладкуТематики", Истина);
	КонецЕсли;
	
	Если Поле = Элементы.Шаблоны Тогда
		ПараметрыОткрытия.Вставить("ОткрытьЗакладкуШаблоны", Истина);
	КонецЕсли;
	
	Если Поле = Элементы.СписокВидыДокументовИндекс Тогда
		ПараметрыОткрытия.Вставить("АктивироватьИндекс", Истина);
	КонецЕсли;
	
	Если Поле = Элементы.ОбработкаЗадана Тогда
		ПараметрыОткрытия.Вставить("АктивироватьОбработку", Истина);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВидыДокументов.ФормаОбъекта",
		ПараметрыОткрытия, Элементы.СписокВидыДокументов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокВидыДокументовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ИспользоватьТематикиДокументов = РаботаСТематикамиДокументов.ТематикиИспользуются();
	
	МассивВидов = Новый Массив;
	Для Каждого КлючИЗначение Из Строки Цикл 
		ДанныеСтроки = КлючИЗначение.Значение.Данные;
		МассивВидов.Добавить(ДанныеСтроки.Ссылка);
		Если ЗначениеЗаполнено(ДанныеСтроки.Родитель) Тогда 
			МассивВидов.Добавить(ДанныеСтроки.Родитель);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивВидов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТематикиДокументов.ВидДокумента КАК ВидДокумента,
		|	КОЛИЧЕСТВО(ТематикиДокументов.Ссылка) КАК КоличествоТематик,
		|	0 КАК КоличествоШаблонов,
		|	0 КАК КоличествоДействий
		|ПОМЕСТИТЬ ОбщаяТаблица
		|ИЗ
		|	Справочник.ТематикиДокументов КАК ТематикиДокументов
		|ГДЕ
		|	НЕ ТематикиДокументов.ПометкаУдаления
		|	И НЕ ТематикиДокументов.НеДействует
		|	И ТематикиДокументов.ВидДокумента В(&ВидыДокументов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТематикиДокументов.ВидДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШаблоныДокументов.ВидДокумента,
		|	0,
		|	КОЛИЧЕСТВО(ШаблоныДокументов.Ссылка),
		|	0
		|ИЗ
		|	Справочник.ШаблоныДокументов КАК ШаблоныДокументов
		|ГДЕ
		|	НЕ ШаблоныДокументов.ПометкаУдаления
		|	И ШаблоныДокументов.ВидДокумента В(&ВидыДокументов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ШаблоныДокументов.ВидДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиОбработкиВидовОбъектов.ВидОбъекта,
		|	0,
		|	0,
		|	КОЛИЧЕСТВО(ВидыДействийНастройки.ВидДействия)
		|ИЗ
		|	Справочник.НастройкиОбработкиВидовОбъектов КАК НастройкиОбработкиВидовОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиОбработкиВидовОбъектов.ВидыДействий КАК ВидыДействийНастройки
		|		ПО НастройкиОбработкиВидовОбъектов.Ссылка = ВидыДействийНастройки.Ссылка
		|ГДЕ
		|	НастройкиОбработкиВидовОбъектов.ВидОбъекта В(&ВидыДокументов)
		|	И НастройкиОбработкиВидовОбъектов.ПометкаУдаления = ЛОЖЬ
		|	И НастройкиОбработкиВидовОбъектов.ДействуетС <= &ДатаОбработки
		|	И (НастройкиОбработкиВидовОбъектов.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КОНЕЦПЕРИОДА(НастройкиОбработкиВидовОбъектов.ДействуетПо, ДЕНЬ) >= &ДатаОбработкиПо)
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиОбработкиВидовОбъектов.ВидОбъекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбщаяТаблица.ВидДокумента КАК ВидДокумента,
		|	СУММА(ОбщаяТаблица.КоличествоТематик) КАК КоличествоТематик,
		|	СУММА(ОбщаяТаблица.КоличествоШаблонов) КАК КоличествоШаблонов,
		|	СУММА(ОбщаяТаблица.КоличествоДействий) КАК КоличествоДействий
		|ИЗ
		|	ОбщаяТаблица КАК ОбщаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщаяТаблица.ВидДокумента";
	
	Запрос.Параметры.Вставить("ВидыДокументов", МассивВидов);
	Запрос.Параметры.Вставить("ДатаОбработки", ТекущаяДатаСеанса());
	Запрос.Параметры.Вставить("ДатаОбработкиПо", КонецДня(ТекущаяДатаСеанса()));
	ТематикиИШаблоныВидов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого КлючИЗначение Из Строки Цикл 
		ДанныеСтроки = КлючИЗначение.Значение.Данные;
		
		СветофорТематик = 3; СветофорШаблонов = 3; СветофорОбработки = 3;
		
		СтрПоиска = ТематикиИШаблоныВидов.НайтиСтроки(Новый Структура("ВидДокумента", ДанныеСтроки.Ссылка));
		Если ИспользоватьТематикиДокументов И ДанныеСтроки.ВестиУчетПоТематикам Тогда 
			Если СтрПоиска.Количество() > 0 И СтрПоиска[0].КоличествоТематик > 0 Тогда 
				
				ДанныеСтроки.Тематики = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
					НСтр("ru = ';%1 тематика;;%1 тематики;%1 тематик;%1 тематика'"),
					СтрПоиска[0].КоличествоТематик);
					
				ДанныеСтроки.КоличествоТематик = СтрПоиска[0].КоличествоТематик;
			Иначе 
				ДанныеСтроки.Тематики = НСтр("ru = 'Не заданы'");
				ДанныеСтроки.КоличествоТематик = 0;
				СветофорТематик = 1;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрПоиска.Количество() > 0 И СтрПоиска[0].КоличествоШаблонов > 0 Тогда
			
			ДанныеСтроки.Шаблоны = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';%1 шаблон;;%1 шаблона;%1 шаблонов;%1 шаблона'"),
				СтрПоиска[0].КоличествоШаблонов);
			 
			ДанныеСтроки.КоличествоШаблонов = СтрПоиска[0].КоличествоШаблонов;
		ИначеЕсли ДанныеСтроки.ЗапретитьСозданиеДокументовНеПоШаблону Тогда 
			ДанныеСтроки.Шаблоны = НСтр("ru = 'Не заданы'");
			ДанныеСтроки.КоличествоШаблонов = 0;
			СветофорШаблонов = 2;
		КонецЕсли;
		
		ОбработкаЗадана = Ложь;
		Если СтрПоиска.Количество() > 0 И СтрПоиска[0].КоличествоДействий > 0 Тогда 
			ОбработкаЗадана = Истина;
		Иначе
			СтрПоискаРодителя = ТематикиИШаблоныВидов.НайтиСтроки(
				Новый Структура("ВидДокумента", ДанныеСтроки.Родитель));
			
			Если СтрПоискаРодителя.Количество() > 0 И СтрПоискаРодителя[0].КоличествоДействий > 0 Тогда 
				ОбработкаЗадана = Истина;
			Иначе
				СветофорОбработки = 2;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеСтроки.Свойство("ОбработкаЗадана") Тогда
			ДанныеСтроки.ОбработкаЗадана = ОбработкаЗадана;
		КонецЕсли;
				
		Если ДанныеСтроки.ЭтоГруппа Тогда 
			ДанныеСтроки.КартинкаСветофор = 0;
		Иначе 
			ДанныеСтроки.КартинкаСветофор = Мин(СветофорТематик, СветофорШаблонов, СветофорОбработки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВидыДокументовОбработкаЗапросаОбновления(Элемент)
	
	Элементы.СписокВидыДокументов.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	 
	ОповеститьОВыборе(Элементы.СписокВидыДокументов.ТекущаяСтрока);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУдаленные(Команда)
	
	ПоказыватьУдаленные = Не ПоказыватьУдаленные;
	Элементы.СписокВидыДокументовПоказыватьУдаленные.Пометка = ПоказыватьУдаленные;
	
	Если Не ПоказыватьУдаленные Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокВидыДокументов, "ПометкаУдаления", Ложь,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокВидыДокументов, "ПометкаУдаления");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьУдаленные()
	
	Элементы.СписокВидыДокументовПоказыватьУдаленные.Пометка = ПоказыватьУдаленные;
	
	Если Не ПоказыватьУдаленные Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокВидыДокументов, "ПометкаУдаления", Ложь,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокВидыДокументов, "ПометкаУдаления");
	КонецЕсли;
		
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции_МобильныйКлиент

&НаСервере
Процедура НастроитьФормуДляМобильногоПриНеобходимости()
	
	Если Не ПараметрыСеанса.ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	// Список.
	Элементы.СписокВидыДокументов.Шапка = Ложь;
	
	Элементы.Тематики.Видимость = Ложь;
	Элементы.ОбработкаЗадана.Видимость = Ложь;
	Элементы.СписокВидыДокументовЗапретитьСозданиеДокументовНеПоШаблону.Видимость = Ложь;
	Элементы.СписокВидыДокументовИндекс.Видимость = Ложь;
	Элементы.СписокВидыДокументовФормаДокумента.Видимость = Ложь;
	Элементы.ЯвляетсяДоговоромВн.Видимость = Ложь;
	Элементы.СписокВидыДокументовУчитыватьСуммуДокумента.Видимость = Ложь;
	Элементы.СписокВидыДокументовУчитыватьКорреспонденцию.Видимость = Ложь;
	Элементы.КомментарийВн.Видимость = Ложь;
	Элементы.СрокИсполненияВн.Видимость = Ложь;
	Элементы.ИспользоватьСрокИсполненияВн.Видимость = Ложь;
	Элементы.ВестиУчетПоНоменклатуреДелВн.Видимость = Ложь;
	Элементы.ВестиУчетПоКонтрагентамВн.Видимость = Ложь;
	Элементы.УчитыватьСрокДействияВн.Видимость = Ложь;
	Элементы.УчитыватьСуммуДокументаВн.Видимость = Ложь;
	Элементы.УчитыватьНедействующиеДокументыВн.Видимость = Ложь;
	Элементы.ЯвляетсяКомплектомДокументовВн.Видимость = Ложь;
	Элементы.СсылкаВн.Видимость = Ложь;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
